export const CATEGORY_GROUP_CODE = [
  "MT1",
  "CS2",
  "PS3",
  "SC4",
  "AC5",
  "PK6",
  "OL7",
  "SW8",
  "BK9",
  "CT1",
  "AG2",
  "PO3",
  "AT4",
  "AD5",
  "FD6",
  "CE7",
  "HP8",
  "PM9",
] as const;

export const MAX_SIZE = 15;

export const UPSTREAM_TIMEOUT = 3 * 1000;

export const KAKAO_ERROR_CODE = {
  "-1": "서버 내부에서 처리 중에 에러가 발생한 경우",
  "-2": "필수 인자가 포함되지 않은 경우나 호출 인자값의 데이타 타입이 적절하지 않거나 허용된 범위를 벗어난 경우",
  "-3": "해당 API를 사용하기 위해 필요한 기능(간편가입, 동의항목, 서비스 설정 등)이 활성화 되지 않은 경우",
  "-4": "계정이 제재된 경우나 해당 계정에 제재된 행동을 하는 경우",
  "-5": "파라미터 값이 부적절한 경우",
  "-6": "일반적인 응답 실패",
  "-7": "인증에 실패한 경우",
  "-8": "권한이 없는 경우",
  "-9": "조회된 데이터가 없는 경우",
};
