import { ErrorMetadata } from "./search.types";

const errors: Record<string, ErrorMetadata> = {
  "-1": {
    code: "-1",
    message: "서버 내부에서 처리 중에 에러가 발생한 경우",
    resolution: "재시도",
  },
  "-2": {
    code: "-2",
    message: "승인되지 않은 KEY 입니다.",
    resolution: "정확한 승인키를 입력하세요.(팝업API 승인키 사용불가)",
  },
  "-3": {
    code: "-3",
    message: "검색어가 입력되지 않았습니다.",
    resolution: "도로명주소 도움센터로 문의하시기 바랍니다.",
  },
  "-4": {
    code: "-4",
    message: "주소를 상세히 입력해주시기 바랍니다.",
    resolution: "시도명으로는 검색이 불가합니다.",
  },
  "-5": {
    code: "-5",
    message: "검색어는 두 글자 이상 입력되어야 합니다.",
    resolution: "한 글자만으로는 검색이 불가합니다.",
  },
  "-6": {
    code: "-6",
    message: "검색어는 문자와 숫자 같이 입력되어야 합니다.",
    resolution: "숫자만으로는 검색이 불가합니다.",
  },
  "-7": {
    code: "-7",
    message: "검색어가 너무 깁니다. (한글 40자, 영문, 숫자 80자 이하)",
    resolution: "80글자를 초과한 검색어는 검색이 불가합니다.",
  },
  "-8": {
    code: "-8",
    message: "검색어에 너무 긴 숫자가 포함되어 있습니다. (숫자 10자 이하)",
    resolution: "10자리를 초과하는 숫자가 포함된 검색어는 검색이 불가합니다.",
  },
  "-9": {
    code: "-9",
    message: "특수문자+숫자만으로는 검색이 불가능 합니다.",
    resolution: "특수문자와 숫자만으로 이루어진 검색어는 검색이 불가합니다.",
  },
  "-10": {
    code: "-10",
    message: "SQL 예약어 또는 특수문자( %,=,>,<,[,] )는 검색이 불가능 합니다.",
    resolution: "SQL 예약어 또는 특수문자를 제거 후 검색합니다.",
  },
  "-401": {
    code: "-401",
    message: "개발승인키 기간이 만료되어 서비스를 이용하실 수 없습니다.",
    resolution: "개발승인키를 다시 발급받아 API 서비스를 호출합니다.",
  },
  "-501": {
    code: "-501",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-602": {
    code: "-602",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-603": {
    code: "-603",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-606": {
    code: "-606",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-903": {
    code: "-903",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-911": {
    code: "-911",
    message: "검색 범위를 초과하였습니다.",
    resolution: "검색결과가 9천건이 초과하는 검색은 불가합니다.",
  },
  "-9798": {
    code: "-9798",
    message: "서비스 점검중	",
    resolution: "",
  },
};
